{"format": "graph-model", "generatedBy": "2.9.2", "convertedBy": "TensorFlow.js Converter v4.1.0", "signature": {"inputs": {"image": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "299"}, {"size": "299"}]}}}, "outputs": {"probability": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/onnx_tf_prefix_/Constant", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Where", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_6/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "PartitionedCall/transpose_9/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_11/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "PartitionedCall/transpose_14/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/transpose_16/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "8"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "PartitionedCall/transpose_17/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/All", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "PartitionedCall/transpose_18/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/transpose_19/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/flatten/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/flatten/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/transpose_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/transpose_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}}}, {"name": "PartitionedCall/mul_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "PartitionedCall/transpose_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}}}, {"name": "PartitionedCall/mul_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "299"}, {"size": "299"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond/PartitionedCall/Const/_35", "op": "Switch", "input": ["PartitionedCall/Const", "PartitionedCall/All"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond/switch_pred/_32", "op": "Switch", "input": ["PartitionedCall/All", "PartitionedCall/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["image", "PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond/pivot_f/_33", "op": "Identity", "input": ["PartitionedCall/cond/switch_pred/_32"], "attr": {"T": {"type": "DT_BOOL"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "PartitionedCall/convolution", "op": "Conv2D", "input": ["PartitionedCall/transpose_1", "PartitionedCall/split"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "PartitionedCall/cond/else/_31/cond/Shape", "op": "Const", "input": ["^PartitionedCall/cond/pivot_f/_33"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond/else/_31/cond/range_1", "op": "Const", "input": ["^PartitionedCall/cond/pivot_f/_33"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2_1/axis", "op": "Const", "input": ["^PartitionedCall/cond/pivot_f/_33"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/cond/else/_31/cond/range", "op": "Const", "input": ["^PartitionedCall/cond/pivot_f/_33"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2/axis", "op": "Const", "input": ["^PartitionedCall/cond/pivot_f/_33"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Add", "op": "AddV2", "input": ["PartitionedCall/convolution", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2_1", "op": "GatherV2", "input": ["PartitionedCall/cond/PartitionedCall/Const/_35", "PartitionedCall/cond/else/_31/cond/range_1", "PartitionedCall/cond/else/_31/cond/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/cond/PartitionedCall/Const/_35", "PartitionedCall/cond/else/_31/cond/range", "PartitionedCall/cond/else/_31/cond/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/Add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/cond/else/_31/cond/Neg", "op": "Neg", "input": ["PartitionedCall/cond/else/_31/cond/GatherV2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond/else/_31/cond/ArithmeticOptimizer/AddOpsRewrite_sub", "op": "AddN", "input": ["PartitionedCall/cond/else/_31/cond/Shape", "PartitionedCall/cond/else/_31/cond/GatherV2_1", "PartitionedCall/cond/else/_31/cond/GatherV2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/MaxPool2d", "PartitionedCall/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/mul_1", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu", "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/mul_1", "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_6", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/add_1", "PartitionedCall/transpose_6/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1", "op": "Conv2D", "input": ["PartitionedCall/transpose_6", "PartitionedCall/split_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/Add_1", "op": "AddV2", "input": ["PartitionedCall/convolution_1", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MaxPool2d_1", "op": "MaxPool", "input": ["PartitionedCall/Add_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/transpose_9", "op": "Transpose", "input": ["PartitionedCall/MaxPool2d_1", "PartitionedCall/transpose_9/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_1", "op": "Relu", "input": ["PartitionedCall/transpose_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/mul_1", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_1", "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/mul_1", "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_11", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/add_1", "PartitionedCall/transpose_11/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_2", "op": "Conv2D", "input": ["PartitionedCall/transpose_11", "PartitionedCall/split_2"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add_2", "op": "AddV2", "input": ["PartitionedCall/convolution_2", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MaxPool2d_2", "op": "MaxPool", "input": ["PartitionedCall/Add_2"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/transpose_14", "op": "Transpose", "input": ["PartitionedCall/MaxPool2d_2", "PartitionedCall/transpose_14/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_2", "op": "Relu", "input": ["PartitionedCall/transpose_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/mul_1", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_2", "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/mul_1", "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_16", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/add_1", "PartitionedCall/transpose_16/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution_3", "op": "Conv2D", "input": ["PartitionedCall/transpose_16", "PartitionedCall/split_3"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "PartitionedCall/Add_3", "op": "AddV2", "input": ["PartitionedCall/convolution_3", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_17", "op": "Transpose", "input": ["PartitionedCall/Add_3", "PartitionedCall/transpose_17/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond/PartitionedCall/transpose_17/_36", "op": "Switch", "input": ["PartitionedCall/transpose_17", "PartitionedCall/All"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond/else/_31/cond/Slice", "op": "Slice", "input": ["PartitionedCall/cond/PartitionedCall/transpose_17/_36", "PartitionedCall/cond/else/_31/cond/Neg", "PartitionedCall/cond/else/_31/cond/ArithmeticOptimizer/AddOpsRewrite_sub"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond/output/_37", "op": "Merge", "input": ["PartitionedCall/cond/PartitionedCall/transpose_17/_36:1", "PartitionedCall/cond/else/_31/cond/Slice"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/transpose_18", "op": "Transpose", "input": ["PartitionedCall/cond/output/_37", "PartitionedCall/transpose_18/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/transpose_18"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "8", "8", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "8", "8", "1"]}}}}, {"name": "PartitionedCall/transpose_19", "op": "Transpose", "input": ["PartitionedCall/AvgPool", "PartitionedCall/transpose_19/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape_1", "op": "Shape", "input": ["PartitionedCall/transpose_19"], "attr": {"out_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/Shape_1", "PartitionedCall/Squeeze", "PartitionedCall/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/SparseToDense", "op": "SparseToDense", "input": ["PartitionedCall/Where", "PartitionedCall/Cast", "PartitionedCall/GatherV2", "PartitionedCall/zeros_1"], "attr": {"validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/add_4", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/Constant", "PartitionedCall/SparseToDense"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Reshape", "op": "Reshape", "input": ["PartitionedCall/transpose_19", "PartitionedCall/add_4"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/flatten/Shape", "op": "Shape", "input": ["PartitionedCall/onnx_tf_prefix_/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/flatten/Shape", "PartitionedCall/flatten/strided_slice/stack", "PartitionedCall/flatten/strided_slice/stack_1", "PartitionedCall/flatten/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/flatten/Reshape/shape", "op": "Pack", "input": ["PartitionedCall/flatten/strided_slice", "PartitionedCall/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_/Reshape", "PartitionedCall/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/MatMul", "op": "MatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose_20"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_5", "op": "AddV2", "input": ["PartitionedCall/MatMul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_3", "op": "Relu", "input": ["PartitionedCall/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_1", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_3", "PartitionedCall/transpose_21"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/add_6", "op": "AddV2", "input": ["PartitionedCall/MatMul_1", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_4", "op": "Relu", "input": ["PartitionedCall/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_2", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_4", "PartitionedCall/transpose_22"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "PartitionedCall/add_7", "op": "AddV2", "input": ["PartitionedCall/MatMul_2", "PartitionedCall/mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_5", "op": "Relu", "input": ["PartitionedCall/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_3", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_5", "PartitionedCall/transpose_23"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_8", "op": "AddV2", "input": ["PartitionedCall/MatMul_3", "PartitionedCall/mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/LogSoftmax", "op": "LogSoftmax", "input": ["PartitionedCall/add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_/LogSoftmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/onnx_tf_prefix_/Constant", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Where", "shape": [0, 1], "dtype": "int32"}, {"name": "PartitionedCall/Cast", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.600595022650326, "scale": 0.004882886363010781, "original_dtype": "float32"}}, {"name": "unknown_0", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21542397293390012, "scale": 0.0019234283297669653, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_4/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/mul", "shape": [1, 64, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.36287522315979, "scale": 1.2495812874214323, "original_dtype": "float32"}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn1/BatchNormalization/sub", "shape": [1, 64, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.400835710413316, "scale": 0.018336815460055483, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_6/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_1", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3042797789854162, "scale": 0.0024149188808366365, "original_dtype": "float32"}}, {"name": "unknown_6", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3598863482475281, "scale": 0.0013333057509917839, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_9/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/mul", "shape": [1, 32, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.27456408739089966, "scale": 0.003911744145786061, "original_dtype": "float32"}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn2/BatchNormalization/sub", "shape": [1, 32, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0191968943558487, "scale": 0.00743939338945875, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_11/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_2", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4221729261033675, "scale": 0.003324196268530453, "original_dtype": "float32"}}, {"name": "unknown_12", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8221196532249451, "scale": 0.00294150943849601, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_14/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/mul", "shape": [1, 16, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5844248533248901, "scale": 0.025149964818767474, "original_dtype": "float32"}}, {"name": "PartitionedCall/onnx_tf_prefix_/bn3/BatchNormalization/sub", "shape": [1, 16, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5381838083267212, "scale": 0.001834047162065319, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_16/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_3", "shape": [3, 3, 16, 8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2297815196654376, "scale": 0.0020156273654862947, "original_dtype": "float32"}}, {"name": "unknown_18", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19597207518184886, "scale": 0.00210722661485859, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_17/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/Const", "shape": [8], "dtype": "int32"}, {"name": "PartitionedCall/All", "shape": [], "dtype": "bool"}, {"name": "PartitionedCall/transpose_18/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_19/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/Squeeze", "shape": [0], "dtype": "int32"}, {"name": "PartitionedCall/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/zeros_1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/transpose_20", "shape": [128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.274156376544167, "scale": 0.0021252432290245504, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_1", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25975807133842915, "scale": 0.0012548699098474838, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_21", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22174727285609527, "scale": 0.00180282335655362, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_3", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09343092885671878, "scale": 0.0005913349927640428, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_22", "shape": [32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23185640468316918, "scale": 0.00203382811125587, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_5", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.07378841936588287, "scale": 0.00036231641675911697, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_23", "shape": [16, 2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5356430053710938, "scale": 0.003938551510081572, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_7", "shape": [2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.026762698108659073, "scale": 0.0009228516589192783, "original_dtype": "float32"}}, {"name": "PartitionedCall/cond/else/_31/cond/Shape", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/cond/else/_31/cond/range_1", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/cond/else/_31/cond/range", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/cond/else/_31/cond/GatherV2/axis", "shape": [], "dtype": "int32"}]}]}